//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page1 Описание меню
    \tableofcontents

    \section sec1 Описание структур меню

    Корневые элементы меню имеют тип Page. Вот они:
    \code
    +------------+-------------+
    |  Название  | Название    |
    |  в коде    | пункта меню |
    +------------+-------------+
    | pDisplay  | ДИСПЛЕЙ     |
    | pChanA    | КАНАЛ 1     |
    | pChanB    | КАНАЛ 2     |
    | pTrig     | СИНХР       | 
    | pTime     | РАЗВЕРТКА   |
    | pCursors  | КУРСОРЫ     | 
    | pMemory   | ПАМЯТЬ      |
    | pMeasures | ИЗМЕРЕНИЯ   |
    | pService  | СЕРВИС      |
    | mpHelp     | ПОМОЩЬ      |
    +------------+-------------+
    \endcode

    \section sec2 Принципы наименования структур меню
    \code
    +-------------+-------------+---------------------------------------------+
    | Приставка в | Тип         | Примечание                                  |
    | названии    | структуры   |                                             |
    +-------------+-------------+---------------------------------------------+
    | mb          | Button      |                                             |
    | mc          | Choice      |                                             |
    | mp          | Page        | Корневой элемент раздела меню               |
    | msp         | Page        | Все остальные страницы меню - "подстраницы" |
    | sb          | SmallButton |                                             |
    +-------------+-------------+---------------------------------------------+
    \endcode
    Далее идёт условное название структуры. Например, \b mcShow - структура Choice, обслуживающая пункт меню <b>КУРСОРЫ - Показывать</b>. 
    На слово "показывать" указывает Show, а "КУРСОРЫ" никак не обозначены в названии, потому что областью видимости данного экземпляра структуры 
    является модуль.

    \section sec3 Принципы наименования фунций меню
    \code
    Глагол
    +-----------+-------------+-------------------------------------------------------------------------------+
    | Глагол    | К чему      | Описание                                                                      |
    |           | применим    |                                                                               |
    +-----------+-------------+-------------------------------------------------------------------------------+
    | DrawSB    | SmallButton | Функция отрисовски структуры SmallButton                                      |
    | IsActive  | All         | Функция возвращает true, если элемент активен. Применимо ко всем элементам    |
    | OnChanged | Choice      | Функция вызывается при изменении настройки Choice                             |
    | OnPress   | Button      | Реакция на нажатие элемента типа Button                                       |
    | OnRotate  | Regulator   | Реакция на поворот ручки                                                      |
    +-----------+-------------+-------------------------------------------------------------------------------+
    \endcode
*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*! \page page2 Хранение серийного номера

    Серийный номер хранится в OTP(One-Time-Programming (одноразово программируемой)) памяти.\n
    Структура OTP-памяти описана в секции 2.7 документа "PM0059 Programming manual STM32F205/215, STM32F207/217 Flash programming manual".\n
    В идеале серийный номер в текстовом виде хранится в 16 байтах по адресу 0x1FFF7800.\n
    Однако со временем может понадобиться изменить серийный номер (например, в случае изменения прошивки альтеры). В этом случае 16 байт, в которых 
    записан текущий (неверный серийный номер), заполняются нулями, и новый номер записывается в следующих 16 байтах. Т.е. алгоритм считывания серийного 
    номера такой.\n
        1. Устанавливаем адрес address = 0x1FFF7800.\n
        2. Cчитываем 16 байт, начиная с адреса address.\n
        3. Увеличиваем address на 16 байт.\n
        4. Если все считанные байты равны 0, то переходим на 2.\n
        5. В считанных байтах находится серийный номер в виде текстовой строки, заканчивающейся нулём.\n
    Серийный номер записывается из меню <b>ОТЛАДКА</b> - <b>С/Н</b>.
*/